##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################

### 미분(Derivative)
## 입력변수가 2개 이상인 다변수 함수의 미분

# f(x,y,z) = x^5 - 1/x^2 + cos(x)^(x - 1)^x

# deriv 함수를 이용하면 다변수 함수의 미분을 구할 수 있음

fxyz = expression((x*y)^5-1/x^z+cos(x)^x)
deriv(fxyz , c('x', 'y', 'z'))



############################################################결과값(print)#################################################################

# > fxyz = expression((x*y)^5-1/x^z+cos(x)^x)
# > deriv(fxyz , c('x', 'y', 'z'))
# expression({
#  .expr1 <- x * y
#  .expr3 <- x^z
#  .expr6 <- cos(x)
#  .expr7 <- .expr6^x
#  .expr9 <- .expr1^4
#  .expr15 <- .expr3^2
#  .value <- .expr1^5 - 1/.expr3 + .expr7                                                  # 원래 함수를 알려준다.
#  .grad <- array(0, c(length(.value), 3L), list(NULL, c("x", "y", "z")))
#  .grad[, "x"] <- 5 * (y * .expr9) + x^(z - 1) * z/.expr15 +                              # x에 대한 미분이다.
#   (.expr7 * log(.expr6) - .expr6^(x - 1) * (x * sin(x)))
#  .grad[, "y"] <- 5 * (x * .expr9)                                                        # y에 대한 미분이다.
#  .grad[, "z"] <- .expr3 * log(x)/.expr15                                                 # z에 대한 미분이다.
#  attr(.value, "gradient") <- .grad
#  .value })

##########################################################################################################################################

fxyz = expression((x*y)^5-1/x^z+cos(x)^x)
D(fxyz, 'y')


############################################################결과값(print)#################################################################

# > fxyz = expression((x*y)^5-1/x^z+cos(x)^x)
# > D(fxyz, 'y')
# 5 * (x * (x * y)^4)

##########################################################################################################################################
