##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################

### 배열 (Array)

# 행렬은 주로 2차원 데이터를 다룰 때 사용을 한다.
# 반면에 배열은 3차원 이상의 데이터를 다룰때 사용한다.

# array() 함수를 이용하면 배열을 생성할 수 있다.
# array() 함수의 첫 번째 인수는 배열을 채울 숫자벡터이고, 두 번째 인수는 차원을 나타내는 벡터이다.

# 두 번째 인수가 만약 c(2,2,3)이라면 1차원은 원소가 2개, 2차원은 원소가 2개, 3차원은 원소가 3개라는 뜻.

x<-array(1:3,c(2,2,3))  # x변수에 array(배열형태)의 1*3 행렬 생성.
x                       # 벡터는 총 3차원으로 이루어져 있음 (1차원=2, 2차원=2, 3차원=3)        



############################################################결과값(print)#################################################################

# > x<-array(1:3,c(2,2,3))  # x변수에 array(배열형태)의 1*3 생성
# > x                       # 벡터는 총 3차원으로 이루어져 있음 (1차원=2, 2차원=2, 3차원=3)

# , , 1                     # 1 차원    

# [,1] [,2]
# [1,]    1    3
# [2,]    2    1

# , , 2                     # 2 차원

# [,1] [,2]
# [1,]    2    1
# [2,]    3    2

# , , 3                     # 3 차원

# [,1] [,2]
# [1,]    3    2
# [2,]    1    3

##########################################################################################################################################

# x의 dimension 속성을 없애면 벡터가 된다.
# 즉 벡터는 1차원의 숫자를 연결한 것이고, 행렬 또는 배열은 2차원으로 숫자를 배열한 것.
# 배열에서 2차원 정보를 없애면 벡터와 동일해 진다는 뜻.

attr(x, "dim")<-NULL
is.array(x)

is.vector(x)

############################################################결과값(print)#################################################################

# > attr(x, "dim")<-NULL

# > is.array(x)
# [1] FALSE
 
#  > is.vector(x)
# [1] TRUE


##########################################################################################################################################