##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################

### 데이터 프레임

# 외부파일로부터 R에 데이터를 불러올 때 사용하는 함수들은 불러들인 데이터를 모두 데이터프레임으로 변환.
# 데이터 프레임은 데이터베이스라고 이해하면 됨.
# 필드와 레코드로 이루어져 있음.
# 데이터 프레임에서는 각 행의 개수가 모든 열에서 동일해야 함.

df<-data.frame(col1=c(1,2,3), col2=c(1,2,3,4))

df<-data.frame(id=c("kim", "lee", "park"), score=c(50, 55, 43))
names(df)

dim(df)

str(df)

summary(df)

nrow(df)

ncol(df)

# 데이터프레임의 대략적인 형태를 알아보기 위해서는 names, str, summary 등의 함수를 이용.

############################################################결과값(print)#################################################################

# > df<-data.frame(col1=c(1,2,3), col2=c(1,2,3,4))

# Error in data.frame(col1 = c(1, 2, 3), col2 = c(1, 2, 3, 4)) : 
# arguments imply differing number of rows: 3, 4


# > df<-data.frame(id=c("kim", "lee", "park"), score=c(50, 55, 43))

# > names(df)
# [1] "id"    "score"

# > 

# > dim(df)
# [1] 3 2

# > 

#   > str(df)
# 'data.frame':	3 obs. of  2 variables:
# $ id   : chr  "kim" "lee" "park"
# $ score: num  50 55 43

# > 

#  > summary(df)
# id                score      
# Length:3           Min.   :43.00  
# Class :character   1st Qu.:46.50  
# Mode  :character   Median :50.00  
# Mean   :49.33  
# 3rd Qu.:52.50  
# Max.   :55.00  

# > 

# > nrow(df)
# [1] 3

# > 

#  > ncol(df)
# [1] 2


##########################################################################################################################################

df

df$id

# $연산자를 이용하여 특정 필드(field)에 접근.

############################################################결과값(print)#################################################################

# > df

# id score
# 1  kim    50
# 2  lee    55
# 3 park    43

# > 

#  > df$id
# [1] "kim"  "lee"  "park"

##########################################################################################################################################

df<-data.frame(id=c("kim", "lee", "park"), score=c(50,55,43))
x<-df[1,2]
x

# [,] 연산자를 이용해서 요소에 접근할 수 있음.

############################################################결과값(print)#################################################################

# > df<-data.frame(id=c("kim", "lee", "park"), score=c(50,55,43))

# > x<-df[1,2]

# > x
# [1] 50

##########################################################################################################################################
