##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################

### 데이터 프레임

# 외부파일로부터 R에 데이터를 불러올 때 사용하는 함수들은 불러들인 데이터를 모두 데이터프레임으로 변환.
# 데이터 프레임은 데이터베이스라고 이해하면 됨.
# 필드와 레코드로 이루어져 있음.
# 데이터 프레임에서는 각 행의 개수가 모든 열에서 동일해야 함.


##########################################################################################################################################


.libPaths("C://Users//yjang//R")

require(stats)
formula(PlantGrowth)

pg<-unstack(PlantGrowth)
pg

stack(pg)

# PlantGrowth는 R에 내장되어 있는 데이터의 집합으로써 Dobson(1983)의 책에서 설명한 3가지 서로 다른 환경에서 자란 식물의 무게
# 즉 정상적인 환경(control)과 두 가지의 비옥한 환경(two different treatment)에서의 자란 10개 표본 식물의 무게를 의미.

# 아래의 결과를 보면 레코드 별로 한 줄의 자료를 만드는 것이 stack이고, 속성별로 값을 묶어 놓는 것이 unstack.



############################################################결과값(print)#################################################################

# > require(stats)
# > formula(PlantGrowth)
# weight ~ group

# > 

# > pg<-unstack(PlantGrowth)
# > pg

# ctrl trt1 trt2
# 1  4.17 4.81 6.31
# 2  5.58 4.17 5.12
# 3  5.18 4.41 5.54
# 4  6.11 3.59 5.50
# 5  4.50 5.87 5.37
# 6  4.61 3.83 5.29
# 7  5.17 6.03 4.92
# 8  4.53 4.89 6.15
# 9  5.33 4.32 5.80
# 10 5.14 4.69 5.26

# > 

#  > stack(pg)

# values  ind
# 1    4.17 ctrl
# 2    5.58 ctrl
# 3    5.18 ctrl
# 4    6.11 ctrl
# 5    4.50 ctrl
# 6    4.61 ctrl
# 7    5.17 ctrl
# 8    4.53 ctrl
# 9    5.33 ctrl
# 10   5.14 ctrl
# 11   4.81 trt1
# 12   4.17 trt1
# 13   4.41 trt1
# 14   3.59 trt1
# 15   5.87 trt1
# 16   3.83 trt1
# 17   6.03 trt1
# 18   4.89 trt1
# 19   4.32 trt1
# 20   4.69 trt1
# 21   6.31 trt2
# 22   5.12 trt2
# 23   5.54 trt2
# 24   5.50 trt2
# 25   5.37 trt2
# 26   5.29 trt2
# 27   4.92 trt2
# 28   6.15 trt2
# 29   5.80 trt2
# 30   5.26 trt2


##########################################################################################################################################

x<-data.frame(bad=1:3,worse=rnorm(3))
x

colnames(x)<-c("good", "better")
x

colnames(x)[2]<-"super"
x  

# 데이터 필드의 이름을 바꾸려면 colname()함수를 이용하면 됨.


############################################################결과값(print)#################################################################

# > x<-data.frame(bad=1:3,worse=rnorm(3))
# > x

# bad         worse
# 1   1  0.5152836508
# 2   2  0.0007453299
# 3   3 -0.4370925541

# > 

# > colnames(x)<-c("good", "better")
# > x

# good        better
# 1    1  0.5152836508
# 2    2  0.0007453299
# 3    3 -0.4370925541

# > 

#  > colnames(x)[2]<-"super"
# > x

# good         super
# 1    1  0.5152836508
# 2    2  0.0007453299
# 3    3 -0.4370925541

##########################################################################################################################################