##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################

### 데이터 프레임

# 외부파일로부터 R에 데이터를 불러올 때 사용하는 함수들은 불러들인 데이터를 모두 데이터프레임으로 변환.
# 데이터 프레임은 데이터베이스라고 이해하면 됨.
# 필드와 레코드로 이루어져 있음.
# 데이터 프레임에서는 각 행의 개수가 모든 열에서 동일해야 함.


##########################################################################################################################################

### 팩터(factor)

# 벡터는 특수한 형태로 설문조사의 선택문항 등 카테고리를 저장할 수 있는 벡터인 factor의 형태가 존재.
# 즉, 범주형 변수(Categorical variable)를 다루기 위한 데이터 유형.

# 범주형 변수의 가능한 값을 level이라고 명칭
# level의 벡터를 factor라고 부름.

# factor는 벡터를 기본으로 하여 함수 factor()를 이용하여 작성 가능.

data = c(1,2,2,3,1,2,3,3,1,2,3,3,1)
fdata = factor(data)

fdata

############################################################결과값(print)#################################################################

# > data = c(1,2,2,3,1,2,3,3,1,2,3,3,1)
# > fdata = factor(data)

# > 

# > fdata
# [1] 1 2 2 3 1 2 3 3 1 2 3 3 1
# Levels: 1 2 3

##########################################################################################################################################

xv <- c("A", "C", "B", "A", "A", "C", "B") # 문자형 벡터 생성.
x <- factor(xv, levels = c("A", "B", "C")) # 문자형 벡터를 팩터로 변환.
xv

x

# factor () 함수는 두 번째 인수가 주어지면 두번째 인수인 levels 인수에 따라 factor의 레벨을 지정.
# level은 factor에 포함된 카테고리의 목록이 할 수 있음.

# factor와 벡터의 내용을 R에서 출력해보면 factor는 벡터에 레벨정보를 추가한 것.
# R에서 이 레벨의 정보를 이용해 카테고리별 단순집계나 그래프의 성형을 하므 카테고리 변수는 가능한 벡터가 아닌 factor로 변환


############################################################결과값(print)#################################################################

# > xv <- c("A", "C", "B", "A", "A", "C", "B")
# > x <- factor(xv, levels = c("A", "B", "C"))

# > xv
# [1] "A" "C" "B" "A" "A" "C" "B"

# > 

# > x
# [1] A C B A A C B
# Levels: A B C

##########################################################################################################################################

as.numeric(x) 

as.numeric(xv)

# factor와 벡터는 외형상으로 큰 차이는 없어보이지만 R의 내부에서는 매우 다른 형태로 취급
# 예와 같이 벡터를 숫자로 변환하는 as.numeric() 함수를 이용하여 그 결과를 보면 factor는 레벨의 순서에 따라 그 값이 존재하지만, 
# 문자형 벡터는 그렇지 않음.

############################################################결과값(print)#################################################################

# > as.numeric(x) 
# [1] 1 3 2 1 1 3 2

# > 

#  > as.numeric(xv)
# [1] NA NA NA NA NA NA NA
# Warning message:
# NAs introduced by coercion 

##########################################################################################################################################
