##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################

### 벡터화(vectorization)

# 벡터화 =  간단한 코딩 + 빠른 속도.

# 어떤 함수 f(x)가 있는데 그 입력변수인 x는 숫자(scalar)이다.
# 만약에 x의 여러가지 값에 대해서 함수를 적용해야 한다면 일반적으로는 for와 같은 반복문을 사용.
# 벡터 개념을 이용하면 벡터를 입력하고 벡터를 출력함으로써 보다 간단한 코드 작성.

# 벡터화는 벡터 원소 각각에 대해 연산을 하는 것이 아니라, 벡터 전체에 대해 한꺼번에 연산을 하는 것을 의미
# 원소별로 연산을 하는 것보다 벡터화 시키면 편하고 빠름.


##########################################################################################################################################



##########################################################################################################################################

### Vectorize()(


# Vectorize() 함수는 scalar 함수를 벡터화 함수로 만들어 준다.
# 함수에 mapply() 적용된 듯한 효과를 보여줌
# mapply()와 다르게 결과가 값이 아니라 함수.

# 함수 사용법: Vectorize(FUN, vectorize.args=arg.names,SIMPLIFY=TRUE,USE.NAMES=TRUE)

f<-function(x=1:3,y) c(x,y)
f(1:3, 1:3)

vf<-Vectorize(f)
vf(1:3,1:3)

vf(y=1:3)


############################################################결과값(print)#################################################################

# [Workspace loaded from ~/.RData]

# > f<-function(x=1:3,y) c(x,y)
# > f(1:3, 1:3)
# [1] 1 2 3 1 2 3

# > 

#   > vf<-Vectorize(f)
# > vf(1:3,1:3)
# [,1] [,2] [,3]
# [1,]    1    2    3
# [2,]    1    2    3

# > 

#  > vf(y=1:3)
# [,1] [,2] [,3]
# [1,]    1    1    1
# [2,]    2    2    2
# [3,]    3    3    3
# [4,]    1    2    3

##########################################################################################################################################