##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################

### 벡터화(vectorization)

# 벡터화 =  간단한 코딩 + 빠른 속도.

# 어떤 함수 f(x)가 있는데 그 입력변수인 x는 숫자(scalar)이다.
# 만약에 x의 여러가지 값에 대해서 함수를 적용해야 한다면 일반적으로는 for와 같은 반복문을 사용.
# 벡터 개념을 이용하면 벡터를 입력하고 벡터를 출력함으로써 보다 간단한 코드 작성.

# 벡터화는 벡터 원소 각각에 대해 연산을 하는 것이 아니라, 벡터 전체에 대해 한꺼번에 연산을 하는 것을 의미
# 원소별로 연산을 하는 것보다 벡터화 시키면 편하고 빠름.


##########################################################################################################################################



##########################################################################################################################################

### Vectorize()

# 그러면 원래 벡터를 인수로 받는 함수는 어떻게 벡터화할 것인가?

# f 함수는 하나의 벡터와 하나의 스칼라를 입력받는 함수.
# 이 함수를 첫 인수는 벡터로 받고, 2번째 인수도 벡터로 받으면 결과는 다음과 같음.

f<- function(vx,y) sum(vx)-y
vx<-1:3
y<-4:5
f(vx,y)

f<-function(vx,y) {sum(vx)-y}
vf<-Vectorize(f,"y")                      # Vectorize 함수는 scalar 함수를 벡터화해주는 함수. 즉 y에 대해서만 벡터화됨.
vx<-1:3
y<-4:5
vf(vx,y)

############################################################결과값(print)#################################################################

# > f<- function(vx,y) sum(vx)-y
# > vx<-1:3
# > y<-4:5
# > f(vx,y)
# [1] 2 1

# > f<-function(vx,y) {sum(vx)-y}
# > vf<-Vectorize(f,"y")               
# > vx<-1:3
# > y<-4:5
# > vf(vx,y)
# [1] 2 1

##########################################################################################################################################