##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################

### 벡터화(vectorization)

# 벡터화 =  간단한 코딩 + 빠른 속도.

# 어떤 함수 f(x)가 있는데 그 입력변수인 x는 숫자(scalar)이다.
# 만약에 x의 여러가지 값에 대해서 함수를 적용해야 한다면 일반적으로는 for와 같은 반복문을 사용.
# 벡터 개념을 이용하면 벡터를 입력하고 벡터를 출력함으로써 보다 간단한 코드 작성.

# 벡터화는 벡터 원소 각각에 대해 연산을 하는 것이 아니라, 벡터 전체에 대해 한꺼번에 연산을 하는 것을 의미
# 원소별로 연산을 하는 것보다 벡터화 시키면 편하고 빠름.


##########################################################################################################################################



##########################################################################################################################################

### Vectorize()

# 벡터화를 이용하여 행렬의 행 또는 열을 반대로 순서를 바꾸려고 한다.

x<-matrix(1:6,nrow=2,ncol=3)
x

y<-apply(x,2,rev)                         # x의 행(row)요소에 rev 함수를 적용한 결과를 돌려줌. 즉 행의 순서가 바뀜.
y


z<-apply(x,1,rev)                         # x의 열(column)요소에 rev함수를 적용한 결과를 돌려줌. 즉 열의 순서가 바뀜.
z                                         # 유의할 점은 결과가 전치되어 나온다는 점.

t(z)                                      # 원래대로 행렬을 전치시켜주어야 원하는 결과값이 나옴.

############################################################결과값(print)#################################################################

# > x<-matrix(1:6,nrow=2,ncol=3)

# > x
# [,1] [,2] [,3]
# [1,]    1    3    5
# [2,]    2    4    6
# > 

#  > y<-apply(x,2,rev)                         # x의 행(row)요소에 rev 함수를 적용한 결과를 돌려줌. 즉 행의 순서가 바뀜.

# > y
# [,1] [,2] [,3]
# [1,]    2    4    6
# [2,]    1    3    5
# > 

#    > 

#  > z<-apply(x,1,rev)                         # x의 열(column)요소에 rev함수를 적용한 결과를 돌려줌. 즉 열의 순서가 바뀜.
# > z                                         # 유의할 점은 결과가 전치되어 나온다는 점.
# [,1] [,2]
# [1,]    5    6
# [2,]    3    4
# [3,]    1    2

# > 

#  > t(z)                                      # 원래대로 행렬을 전치시켜주어야 원하는 결과값이 나옴.
# [,1] [,2] [,3]
# [1,]    5    3    1
# [2,]    6    4    2

##########################################################################################################################################