##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################



### plot (그래프)

## 고수준 그래프 함수

# 그래프 설정하기.

# 고수준의 그래프 함수는 함수의 인수를 이용해서 축과 문자표시 등에 대한 설정을 할 수 있다.
# 하지만 별도로 제공되는 함수(par 함수 또는 저수준 그래프 함수 등)를 통해서 보다 정밀하게 설정 가능.
# 그래프 함수의 인수를 통해 설정하는 방법 확인.

##########################################################################################################################################

### xlim & ylim.

# 그래프 함수의 xlim인수와 ylim인수를 이용하여 축 범위를 정할 수 있음.

x<-seq(-1,1,0.01)
y<-sin(pi*x)*x*x
par(mfrow=c(1,2))
plot(x,y,type='l')
plot(x,y,type='l', xlim=c(-0.5,0.5))

graphics.off()                    # 그래프 지워주는 함수.


### xlab & ylab.

# xlab 인수와 ylab인수를 이용하여 축이름을 정한다.

x<-seq(-3,3,0.01)
y<-pnorm(x)
par(mfrow=c(1,2))
plot(x,y,type='l')
plot(x,y,type='l', xlab='normal',ylab='density')

graphics.off()                    # 그래프 지워주는 함수.


############################################################결과값(print)#################################################################

# 그래프 찍어보기.


##########################################################################################################################################
