##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################



### hist(히스토그램)

## 히스토그램을 그리는 함수

##########################################################################################################################################

### hist()

x<-c(3,0.5,0.5,0.5,3,2,0.5,0.5,3,3,1)
tmp<-hist(x)

par(mfrow=c(1,2))
tmp<-hist(x, main = "default bin")
tmp<-hist(x, breaks=seq(0,3,0.5), main="user defined bin")


# 시작 구간에서 0.5 항목과 1.0 항목이 합쳐서 표시되는 것은 정확한 분포를 보여주지 못하므로 분리되게 표시해야 함.
# 시작 구간의 시작 값을 0.5보다 작게 주면 이러한 문제를 해결 가능.
# 구간 설정은 break 인수를 통하여 설정.

par(mfrow=c(1,2))
tmp<-hist(x, breaks=seq(0,3,0.5))
tmp<-hist(x, breaks=seq(0,3,0.5), xaxt='n', main="x axis label")
axis(1,at=tmp$mids,label=seq(0.5,3,0.5))
 
# 각 구간에 항목값이 하나만 있을 경우 구간을 하나의 항목값으로 하여 구간의 중간에만 표시하는 것이 좋을 수도 있음.
# hist 함수의 기본값은 그렇지 못하기에, axis 함수를 사용하여 문제해결.
# x 축 눈금라벨이 막대 그래프의 중간에 오게하려면 원래 지정된 라벨을 지우고 axis 함수의 at인수를 위와 같이 지정하여 설정.



x<-c(3,0.5,0.5,0.5,3,2,0.5,0.5,3,3,1)             # 히스토그램을 그릴 데이터.
plot(table(x),type='h',lwd = 5, ylab = "Freq")    # x에 table 함수를 적용. type을 h(histogram-like vertical lines)로 지정.


graphics.off()                    # 그래프 지워주는 함수.

############################################################결과값(print)#################################################################

# 그래프 찍어보기.


##########################################################################################################################################
