##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################



### par함수

# par 함수를 이용하면 그리기 관련 모수(plotting parameter)를 설정을 할 수 있음.
# par 함수를 실행한 뒤의 그래프부터 적용.

# par 함수의 인수 중 축눈금, 축라벨 등과 관련된 인수 확인.


##########################################################################################################################################

### mgp 인수.

# mgp는 3개의 값을 가짐.
# 그래프 안쪽 박스선을 기준으로 얼마나 떨어져 있는지를 지정
# 차례대로 축이름 위치(location of labels), 축눈금 라벨(tick-mark labels)위치, 축눈금(tick-marks)위치를 지정.
# 기본값은 (3,1,0).

par("mgp")

x<-rnorm(200)
y<-25-22*x+5*x^2+rnorm(200)
par(mfrow=c(1,2))
plot(x,y)
par(mar=c(2,1,0))
plot(x,y)



graphics.off()                    # 그래프 지워주는 함수.


############################################################결과값(print)#################################################################

# 그래프 찍어보기.


##########################################################################################################################################
