##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################



### par함수

# par 함수를 이용하면 그리기 관련 모수(plotting parameter)를 설정을 할 수 있음.
# par 함수를 실행한 뒤의 그래프부터 적용.

# par 함수의 인수 중 축눈금, 축라벨 등과 관련된 인수 확인.


##########################################################################################################################################

### mfrow 인수.

# mfrow 인수는 여러 그래프를 한꺼번에 그릴 때 사용.
# 크기가 2인 벡터를 인수로 받으며 첫 인수는 행의 갯수, 두 번째 인수는 열의 개수를 의미.

# 이 경우에는 행에 따라 배열.
# 첫 행을 먼저 채우고 다음으로 두번째 행을 채움.
# 즉 mfrow=c(2,2)이고 그래프가 4개 있다면 다음 순서대로 그래프를 배열.

par(mfrow=c(2,2))                  # 2*2로 그림을 배열.
plot(x1, y1)
plot(x2, y2)
curve(dnorm(x))
curve(sin)


graphics.off()                    # 그래프 지워주는 함수.


############################################################결과값(print)#################################################################

# 그래프 찍어보기.


##########################################################################################################################################
