##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################



### 저수준 그래프 함수

##########################################################################################################################################

### points & lines

# points(x,y), lines(x,y) 형태로 사용하며 각각 점 그래프와 선 그래프를 그려줌.


attach(cars)
plot(cars, xlab="speed[mph]", ylab="distant[ft]")
points(speed[speed<15],dist[speed<15],pch="s",col="blue")
points(speed[speed>=15],dist[speed>=15],pch="f",col="green")
lines(lowess(cars),col="red")

# cars는 자동차의 속도와 제동거리를 모아놓은 R 내장 데이터.
# lowess()는 "locally weighted polynomial regression" 을 통해서 데이터들을 fit하는 함수의 한 종류.

graphics.off()                    # 그래프 지워주는 함수.


############################################################결과값(print)#################################################################

# 그래프 찍어보기.


##########################################################################################################################################
