##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################



### 그래프의 특정영역 칠하기.

##########################################################################################################################################

## 영역에 점을 찍는 방법.

# 해당영역에 임의로 점을 찍어보는 방법이 있음.

x<-seq(-3,3,0.02)
nx<-length(x)                # x 벡터의 크기를 알아낸다.
dy<-1/length(x)              # y 축의 간격을 정한다.
y<-seq(0,1-dy,dy)            # y 축의 좌표를 생성한다.
ny<-length(y)                # y 좌표 벡터의 크기를 알아낸다.
vy<-rep(y,ny)                # y 벡터를 ny만큼 반복해서 총(ny * ny)개의 원소를 가진 벡터를 생성한다.
vx<-NULL                      
for(i in 1:nx){              # x[i]를 ny개만큼씩 옆으로 늘려붙이 벡터 생성.
  vx<-c(vx,rep(x[i],ny))
}                                              
xin<-vx[vy<dnorm(vx)]                          # vy 각 요소와 dnorms(vs) 각 요소를 비교하여 후자가 큰 경우에 해당하는 vx요소를 구한다.
yin<-vy[vy<dnorm(vx)]                          # vy 각 요소와 dnorms(vs) 각 요소를 비교하여 후자가 큰 경우에 해당하는 vy요소를 구한다.  
plot(xin, yin, cex=0.1,col='gray')             # 위에서 구한 요소 쌍을 찍는다.
curve(dnorm(x),-3,3,add = TRUE)                # 정규분포 그래프를 그린다.
grid()


graphics.off()                    # 그래프 지워주는 함수.


############################################################결과값(print)#################################################################

# 그래프 찍어보기.

# > x<-seq(-3,3,0.02)
# > nx<-length(x)
# > dy<-1/length(x)
# > y<-seq(0,1-dy,dy)
# > ny<-length(y)
# > vy<-rep(y,ny)
# > vx<-NULL
# > for(i in 1:nx){
#   +   vx<-c(vx,rep(x[i],ny))
#   + }
# > xin<-vx[vy<dnorm(vx)]
# > yin<-vy[vy<dnorm(vx)]
# > plot(xin, yin, cex=0.1,col='gray')
# > curve(dnorm(x),-3,3,add = TRUE)
# > grid()

##########################################################################################################################################
  