##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################



### 그래프의 특정영역 칠하기.

##########################################################################################################################################

## polygon함수를 이용하는 방법.

# 정규분포 함수에서 확률변수 z가 0에서 1.5 사이에 있을 확률을 빗금으로 보여줌.

plot(dnorm, xlim=c(-3,3))
x<-seq(0,1.5,0.1)
polygon(c(0,x,1.5), c(0,dnorm(x),0),density=10)      # density 인수를 10으로 하면 45도 각도의 빗금으로 다각형 안을 채움.
abline(h=0,col='gray')



graphics.off()                    # 그래프 지워주는 함수.

 ## what if no NA value
 plot(c(1, 6), c(-3.5, 3.5), type = "n")
 x <- c(1, 2, 3, 4, 4, 6)
 y <- c(1, -3, 2, -3, 3, -3)
 polygon(x, y, col = c("yellow", "blue"), border = c("black", "red"),
 lwd = 2, lty = c("dotted", "solid"))
 title("Multiple polygons without NA value")




############################################################결과값(print)#################################################################

# 그래프 찍어보기.

 # > plot(dnorm, xlim=c(-3,3))
 # > x<-seq(0,1.5,0.1)
 # > polygon(c(0,x,1.5), c(0,dnorm(x),0),density=10)      # density 인수를 10으로 하면 45도 각도의 빗금으로 다각형 안을 채움.
 # > abline(h=0,col='gray')

##########################################################################################################################################
