##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################



### 그래프의 특정영역 칠하기.

##########################################################################################################################################

## polygon함수를 이용하는 방법.

x<-seq(-3,3,0.1) 
plot(x,dnorm(x,1,0.5), xlim=c(-3,3),type='l')    # 평균이 1이고 분산이 0.5인 정규분포를 (-3,3) 구간에 그림.
curve(dnorm,add = T)                             # 표준정규분포(평균이 0, 분산이 1)를 그 위에 추가로 (add = T)를 그림.
y<-pmin(dnorm(x,1,0.5),dnorm(x,0,1))             # x가 주어졌을 때, 평균이 1이고, 분산이 0.5인 정규분포함수 값과 표준정규분포함수 
                                                 # 값을 비교하여 작은 값을 y에 저장.  
polygon(x,y,col = 'gray')                        # (x, y) 좌표쌍으로 둘러싸인 다각형을 그리고, 그 내부를 회색으로 칠함.  




graphics.off()                    # 그래프 지워주는 함수.



############################################################결과값(print)#################################################################

# > x<-seq(-3,3,0.1) 
# > plot(x,dnorm(x,1,0.5), xlim=c(-3,3),type='l')    # 평균이 1이고 분산이 0.5인 정규분포를 (-3,3) 구간에 그림.
# > curve(dnorm,add = T)                             # 표준정규분포(평균이 0, 분산이 1)를 그 위에 추가로 (add = T)를 그림.
# > y<-pmin(dnorm(x,1,0.5),dnorm(x,0,1))             # x가 주어졌을 때, 평균이 1이고, 분산이 0.5인 정규분포함수 값과 표준정규분포함수 
# >                                                  # 값을 비교하여 작은 값을 y에 저장.  
#   > polygon(x,y,col = 'gray')                        # (x, y) 좌표쌍으로 둘러싸인 다각형을 그리고, 그 내부를 회색으로 칠함.

##########################################################################################################################################
