##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################


### 두개의 그래프 겹쳐서 그리기.

## par()함수를 이용하는 방법
# par 함수의 new 인수를 이용해서 그래프를 겹치게 그릴 수 있음.


set.seed(1)
x1<-rnorm(20, mean=0, sd=1)
y1<-dnorm(x1, mean=0.2, sd=1)

plot(x1, y1)

x2<-rnorm(20, mean=0, sd=1)
y2<-dnorm(x2, mean=0, sd=1)

par(new=TRUE)                       # par 함수의 new 인수가 TRUE이므로 이후에 그려지는 그래프는 앞에 그려진 그래프에 겹쳐짐.
plot(x2,y2,col="red", pch=2)

graphics.off()                      # 그래프를 지워주는 함수.


############################################################결과값(print)#################################################################

# # # > > set.seed(1)
# > x1<-rnorm(20, mean=0, sd=1)
# > y1<-dnorm(x1, mean=0.2, sd=1)
# > 
#   > plot(x1, y1)
# > 
#   > x2<-rnorm(20, mean=0, sd=1)
# > y2<-dnorm(x2, mean=0, sd=1)
# > 
#   > par(new=TRUE)                       
# > plot(x2,y2,col="red", pch=2)

##########################################################################################################################################
