##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################


### 두개의 그래프 겹쳐서 그리기.

## 고수준 그래프 함수(plot)와 저수준 그래프 함수(points, curve)를 섞어 쓰면 축 범위가 다르거나 겹쳐보이는 현상을 방지할 수 있음.


set.seed(1)
par(mfrow=c(1,2))                   # 좌우 2개의 그래프를 그릴 준비. 왼쪽에는 points 함수를 이용한 결과를, 오른쪽에는 curve를 이용한 결과.
x<-1:10
x1<-rnorm(10)
y=x+x1
plot(y~x, pch=1)                    # plot을 이용하여 그래프.
y2=x
points(y2~x, pch=4, col="red")      # points 함수를 이용하여 그래프를 그림.


graphics.off()                      # 그래프를 지워주는 함수.

set.seed(1)
x<-1:10
x1<-rnorm(10)
y=x+x1
plot(y~x, pch=1)                    # plot을 이용하여 그래프.
f<-function(x) x
curve(f, add=TRUE, col="red")       # curve 함수를 이용하여 그래프를 그림.



graphics.off()                      # 그래프를 지워주는 함수.


############################################################결과값(print)#################################################################

# # #
# > set.seed(1)
# > par(mfrow=c(1,2))
# > x<-1:10
# > x1<-rnorm(10)
# > y=x+x1
# > plot(y~x, pch=1)
# > y2=x
# > points(y2~x, pch=4, col="red")


# > set.seed(1)
# > x<-1:10
# > x1<-rnorm(10)
# > y=x+x1
# > plot(y~x, pch=1)                    # plot을 이용하여 그래프.
# > f<-function(x) x
# > curve(f, add=TRUE, col="red")       # curve 함수를 이용하여 그래프를 그림.


##########################################################################################################################################
