##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################


### 그래프에 그리스 문자 입력하기

## substitute함수를 이용해서 그리스 문자를 입력.

x<-seq(-1,50,0.01)
y<-sin(x)*x
plot(x,y,main = substitute(y==Psi*z-sum(beta^gamma)),type='l')
text(0,10, substitute(Delta[k]==1))
text(30,40,substitute(Delta[k]==epsilon))

graphics.off()                                                                              # 그래프를 지워주는 함수.


############################################################결과값(print)#################################################################

# # # > x<-seq(-1,50,0.01)
# > y<-sin(x)*x
# > plot(x,y,main = substitute(y==Psi*z-sum(beta^gamma)),type='l')
# > text(0,10, substitute(Delta[k]==1))
# > text(30,40,substitute(Delta[k]==epsilon))


##########################################################################################################################################
