##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################


### list를 plot하기.

## 데이터 구조 중 리스트의 그래프를 그림.

dat<-list(a=1:5, b=2:7, c=3:10)                                                              # dat라는 이름의 다음 list를 생성.
plot(unlist(dat), type="n", xlim=c(1,max(sapply(dat, length))))                              # 다음의 복잡한 명령이 한 줄에 표현.

mapply(lines, dat, col=seq_along(dat),lty=2)                                                 # lines함수를 이영하여 그래프를 그림.

legend("topleft", names(dat), lty = 2, col = seq_along(dat))                                 # seq_along은 인수의 길이에 해당하는 수열 생성.

dat

graphics.off()                                                                              # 그래프를 지워주는 함수.


############################################################결과값(print)#################################################################

# # # > dat<-list(a=1:5, b=2:7, c=3:10)                                                              # dat라는 이름의 다음 list를 생성.
# > plot(unlist(dat), type="n", xlim=c(1,max(sapply(dat, length))))                              # 다음의 복잡한 명령이 한 줄에 표현.
# > 
#   > mapply(lines, dat, col=seq_along(dat),lty=2)                                                 # lines함수를 이영하여 그래프를 그림.
# $a
# NULL
# 
# $b
# NULL
# 
# $c
# NULL
# 
# > 
#   > legend("topleft", names(dat), lty = 2, col = seq_along(dat))                                 # seq_along은 인수의 길이에 해당하는 수열 생성.
# > 
#   > dat
# $a
# [1] 1 2 3 4 5
# 
# $b
# [1] 2 3 4 5 6 7
# 
# $c
# [1]  3  4  5  6  7  8  9 10


##########################################################################################################################################