##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################


### 데이터 프레임과 그래프.

## 데이터 프레임으로 그래프 그리기.

df<-data.frame(NULL)
newrow<-1:3
df<-rbind(df,newrow)
newrow<-c(7,1,9)
df<-rbind(df,newrow)
colnames(df)<-c("a","b","c")
x<-matplot(df,type='l')                                                                     # matplot은 행렬을 그래프로 그려주는 함수.
legend("topleft",legend = colnames(df),lty=1:3, bty = "n")                                  # legend함수는 그래프의 범례를 만들어주는 함수.

graphics.off()                                                                              # 그래프를 지워주는 함수.

x<-matplot(df,type = 'l', lty = 1:3, col = 1:3)

graphics.off()                                                                              # 그래프를 지워주는 함수.

# matplot에 데이터프레임을 인수로 입력하면 자동으로 (데이터 계열(series)개수에 맞춰) 순차적으로 선 종류 및 색깔을 사용. 

# 첫 인수는 범례의 위치를 지정하는데 예제와 같이 쓰면 상단좌측에 범례를 만듬.
# legend 인수는 범례에 사용될 문자를 지정하고, lty인수는 선의 종류를 지정. bty인수는 범례테두리를 설정하는 인수인데 "n"을 쓰면 테두리가 없어짐.

############################################################결과값(print)#################################################################

# 


##########################################################################################################################################