##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Finance/R-Finance-Programming 경로에 issue를 남기면 확인

##########################################################################################################################################


### 그래프에 다양한 색깔 적용.

## 함수값이 특정조건일 때 그래프 색깔을 검정색이 아닌 다른 색깔로 표현하면 시각적으로 더 인식이 쉬움.

set.seed(1)
x<-1:100/20
y<-sin(x)+rnorm(100)/5
cols<-ifelse(y>0,"black","gray")                                                            # y의 값이 0보다 클 경우 검정색을, 아니면 회색.
par(mfrow=c(1,2))
plot(x,y,type='h',lwd=2)
plot(x,y,type='h',lwd=2,col=cols)                                                           # col인수에 위 결과를 대입하면 원하는 결과를 얻음.

graphics.off()                                                                              # 그래프를 지워주는 함수.


############################################################결과값(print)#################################################################

# # # #> set.seed(1)
# > x<-1:100/20
# > y<-sin(x)+rnorm(100)/5
# > cols<-ifelse(y>0,"black","gray")                                                            # y의 값이 0보다 클 경우 검정색을, 아니면 회색.
# > par(mfrow=c(1,2))
# > plot(x,y,type='h',lwd=2)
# > plot(x,y,type='h',lwd=2,col=cols)                                                           # col인수에 위 결과를 대입하면 원하는 결과를 얻음.
# > graphics.off()                                                                              # 그래프를 지워주는 함수.

##########################################################################################################################################